<img src="https://raw.githubusercontent.com/paular143/images_notebooks/master/logo-sin-nombre.png" alt="Universidad de Los Andes" style="width: 90px;" align="left" frameborder="300"/>

**UNIVERSIDAD DE LOS ANDES** <br>
**FACULTAD DE ECONOMÍA** <br>
**Taller de Python** <br>
**PROFESOR:** Germán González <br><br>

# Clase 7: Introducción a Pandas

En esta clase estudiaremos _Pandas_, este es el paquete más robusto y famoso en Python para la manipulación de bases de datos.

En Pandas existen tres tipos de estructuras: 

- Series: data en un arreglo 1D, etiquetada, homogénea e inmutable de tamaño
- **Data Frames**: arreglo 2D, tamaño mutable, columnas heterogéneas, etiquetadas
- Panel: arreglo 3D, tamaño mutable.

In [6]:
!pip3 install pandas

Requirement already satisfied: pandas in /Users/germangonzalez/.pyenv/versions/3.7.8/envs/motus/lib/python3.7/site-packages (1.3.3)
Requirement already satisfied: numpy>=1.17.3 in /Users/germangonzalez/.pyenv/versions/3.7.8/envs/motus/lib/python3.7/site-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.3 in /Users/germangonzalez/.pyenv/versions/3.7.8/envs/motus/lib/python3.7/site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/germangonzalez/.pyenv/versions/3.7.8/envs/motus/lib/python3.7/site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in /Users/germangonzalez/.pyenv/versions/3.7.8/envs/motus/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [1]:
import pandas as pd # importe el paquete

In [2]:
pd.__version__

'1.3.3'

<img src="https://pandas.pydata.org/docs/_images/01_table_dataframe.svg" alt="Pandas DataFrame">
<img src="https://pandas.pydata.org/docs/_images/01_table_series.svg" alt="Pandas DataFrame">

## Creación de DataFrame a partir de un diccionario

## Componentes principales de un DataFrame
### `index`

RangeIndex(start=0, stop=4, step=1)

### `columns`

Index(['names', 'sex', 'age', 'grades'], dtype='object')

### `shape`

(4, 4)

### size`

16

### `count`

names     4
sex       3
age       4
grades    4
dtype: int64

### `values`

array([['Mateo', 'F', 24, 4.5],
       ['Julián', 'M', 21, 2.0],
       ['Juan', 'M', 25, 3.25],
       ['Carla', None, 30, 4.0]], dtype=object)

### `T`

            0       1     2      3
names   Mateo  Julián  Juan  Carla
sex         F       M     M   None
age        24      21    25     30
grades    4.5       2  3.25      4

### `dtypes`

names      object
sex        object
age         int64
grades    float64
dtype: object

## Indexación y Ejes

### Filtrar columnas
<img src="https://pandas.pydata.org/docs/_images/03_subset_columns.svg" title = "Columnas">

0     Mateo
1    Julián
2      Juan
3     Carla
Name: names, dtype: object

In [16]:
data.names # Extraiga la colunma names como método

0     Mateo
1    Julián
2      Juan
3     Carla
Name: names, dtype: object

### Filtrar filas
<img src="https://pandas.pydata.org/docs/_images/03_subset_rows.svg" title="Filas">

   names sex  age  grades
0  Mateo   F   24     4.5

### Filas y columnas
<img src="https://pandas.pydata.org/docs/_images/03_subset_columns_rows.svg" title="Filas y Columnas">

   names  age
0  Mateo   24
2   Juan   25

### `set_index`

In [19]:
data.set_index('names', inplace=True) # Ponga la columna names como índice
data

         sex  age  grades
names
Mateo      F   24    4.50
Julián     M   21    2.00
Juan       M   25    3.25
Carla   None   30    4.00

### `.loc` y `.iloc`

In [20]:
print(data.loc['Mateo']) # Extraiga la fila de Mateo usando .loc
print(data.loc[:,'age']) # Extraiga la columna de edad usando .loc
print(data.loc[['Juan', 'Carla'], 'grades']) # Extraiga las notas de Juan y Carla usando .loc

sex         F
age        24
grades    4.5
Name: Mateo, dtype: object
names
Mateo     24
Julián    21
Juan      25
Carla     30
Name: age, dtype: int64
names
Juan     3.25
Carla    4.00
Name: grades, dtype: float64

sex        M
age       21
grades     2
Name: Julián, dtype: object
        age  grades
names
Mateo    24    4.50
Julián   21    2.00
Juan     25    3.25
Carla    30    4.00
       age
names
Mateo   24
Carla   30

### `reset_index()`

In [22]:
data.reset_index(inplace=True, drop=False) # Reinicie el índice
data

    names   sex  age  grades
0   Mateo     F   24    4.50
1  Julián     M   21    2.00
2    Juan     M   25    3.25
3   Carla  None   30    4.00

## Edición de columnas
1. ¿Qué tipo de objeto es una columna?
2. Súmele a la edad 2 años (no guarde el valor, solo imprímalo).
3. Cree una nueva columna, que se llame 'mi_nueva_variable' que sea el número 1 en todas las filas. 
4. Reescale las notas de 0 a 100 en una nueva columna.

In [23]:
type(data.grades)

pandas.core.series.Series

In [24]:
data.age+2 # También vea como usar .add(), .sub(), .mul() y .div()

0    26
1    23
2    27
3    32
Name: age, dtype: int64

## Estadísticas descriptivas (Revise axis=0 y axis=1)
### `sum()`

### `min()`

names                Carla
age                     21
grades                   2
mi_nueva_variable        1
rescaled_grades         40
dtype: object

### `max()`

names                Mateo
age                     30
grades                 4.5
mi_nueva_variable        1
rescaled_grades         90
dtype: object

### `argmin()` y `argmax()`

1

0

### `idxmin()` y `idxmax()`

### `describe()`

### `mean()`

### median()

## Aplicar Funciones
Es necesario comprender que `lambda` y usar `.apply`

          names  sex  age  grades  mi_nueva_variable  rescaled_grades
0    MateoMateo   FF   48     9.0                  2            180.0
1  JuliánJulián   MM   42     4.0                  2             80.0
2      JuanJuan   MM   50     6.5                  2            130.0
3    CarlaCarla  NaN   60     8.0                  2            160.0

## Ordenar valores
### `sort_values`

## Borrar Filas y Columnas
### `drop()`

### `drop_na()`

## Importar Datos _csv_ y _xlsx_

## Ejercicio:
1. ¿Cuántos muertos hay registrados en la base de datos? 
2. ¿Cuántos heridos?
3. ¿Cuantos accidentes hubo en Santa Fe? ¿Cuántos muertos y cuántos heridos?
4. Explore la columna TipoTiempo, ¿cuál es la categoría en la que más ocurren accidentes?